Repository: sfshameem5/prayer-times-flutter
Catalog: lib/l10n/app_*.arb
Languages: si, ta

# appTitle
source: Prayer Times
si: ප්‍රාර්ථනා වේලාවන්
ta: வழிபாட்டு நேரங்கள்

# navPrayers
source: Prayers
si: නමස්
ta: தொழுகை

# navQibla
source: Qibla
si: කිබ්ලා
ta: கிப்லா

# navCalendar
source: Calendar
si: දිනදර්ශනය
ta: நாட்காட்டி

# navSettings
source: Settings
si: සිටුවම්
ta: அமைப்புகள்

# onboardingLanguageTitle
source: Choose Your Language
si: ඔබේ භාෂාව තෝරන්න
ta: உங்கள் மொழியைத் தேர்வுசெய்க

# onboardingLanguageSubtitle
source: You can change this later in Settings
si: ඔබට මෙය පසුව සැකසුම් තුළ වෙනස් කළ හැක.
ta: பின்னர் அமைப்புகளில் மாற்றலாம்

# languageEnglish
source: English
si: ඉංග්‍රීසි
ta: ஆங்கிலம்

# languageTamil
source: Tamil (தமிழ்)
si: දෙමළ (தமிழ்)
ta: தமிழ் (தமிழ்)

# languageSinhala
source: Sinhala (සිංහල)
si: සිංහල (සිංහල)
ta: சிங்களம் (සිංහල)

# onboardingGreeting
source: Assalamu Alaikum
si: අස්සලාමු අලයිකුම්
ta: அஸ்ஸலாமு அலைக்கும்

# onboardingAppearance
source: Appearance
si: පෙනුම
ta: தோற்றம்

# onboardingRegion
source: Region
si: කලාපය
ta: பிராந்தியம்

# onboardingStayOnTime
source: Stay on Time
si: වේලාවට
ta: நேரத்திற்கு

# onboardingReminderQuestion
source: How would you like to be reminded for prayers?
si: ආගමික වතාවත් සඳහා ඔබට කෙසේ මතක් කිරීමට අවශ්‍යද?
ta: தொழுகைக்கான நினைவூட்டலை எப்படிப் பெற விரும்புகிறீர்கள்?

# onboardingChoiceNotifications
source: Notifications
si: දැනුම්දීම්
ta: அறிவிப்புகள்

# onboardingChoiceNotificationsDesc
source: Get a notification reminder for each prayer
si: එක් එක් නමස් සඳහා දැනුම්දීම් ලබා ගන්න
ta: ஒவ்வொரு நமாஸுக்கும் அறிவிப்பு பெறுங்கள்

# onboardingChoiceAzaan
source: Azaan Alarm
si: ආගමික ඇඟවීම
ta: அதான் அலாரம்

# onboardingChoiceAzaanDesc
source: Play the Azaan sound as a full alarm for each prayer
si: එක් එක් නමස් සඳහා සම්පූර්ණ ඇලාම් ලෙස අදාන් ඕලි
ta: ஒவ்வொரு நமாஸுக்கும் முழு அலாரமாக அதான் ஒலி

# onboardingChoiceNone
source: No notifications
si: දැනුම්දීම් නොවේ
ta: அறிவிப்புகள் வேண்டாம்

# onboardingChoiceNoneDesc
source: I don't want any reminders. I'll enable them later in Settings.
si: මට මතක් කිරීම් අවශ්‍ය නැහැ. පසුව සිටුවම් තුළ සක්‍රීය කරගන්නම්.
ta: எனக்கு நினைவூட்டல் வேண்டாம். பின்னர் அமைப்புகளில் இயக்குவேன்.

# onboardingChoiceInfo
source: You can configure this per prayer later in Settings
si: පසුව සැකසුම් වලින් එක් එක් නමස් සඳහා වෙනස් කළ හැක
ta: பின்னர் அமைப்புகளில் ஒவ்வொரு தொழுகைக்கும் மாற்றலாம்

# onboardingAllSet
source: You're All Set!
si: සියල්ලම සූදානම්!
ta: அனைத்தும் தயார்!

# onboardingReady
source: Your prayer times are ready
si: ඔබගේ නමස් වේලාවන් සූදානම්
ta: உங்கள் தொழுகை நேரங்கள் தயார்

# onboardingNotificationsDisabled
source: Notifications are disabled. You can enable them later in Settings.
si: දැනුම්දීම් අක්‍රීයයි. පසුව සිටුවම් තුළ සක්‍රීය කළ හැක.
ta: அறிவிப்புகள் முடக்கப்பட்டுள்ளன. பின்னர் அமைப்புகளில் இயக்கலாம்.

# onboardingSummaryRegion
source: Region
si: කලාපය
ta: பிராந்தியம்

# onboardingSummaryAlertMode
source: Alert Mode
si: අතුරුදහන් ආකාරය
ta: அறிவிப்பு முறை

# onboardingSummaryTheme
source: Theme
ta: தீம்

# onboardingAlertModeAzaan
source: Azaan Alarm
si: ආගමික ඇඟවීම
ta: அதான் அலாரம்

# onboardingAlertModeNotifications
source: Notifications
si: දැනුම්දීම්
ta: அறிவிப்புகள்

# onboardingAlertModeDisabled
source: Disabled
si: අක්‍රීයයි
ta: முடக்கப்பட்டுள்ளது

# onboardingThemeSystem
source: System
si: පෙරනිමි
ta: கணினி

# onboardingThemeLight
source: Light
si: ලයිට්
ta: ஒளி

# onboardingThemeDark
source: Dark
si: අඳුරු
ta: இருள்

source: Back
si: ආපසු
ta: பின்

source: Next
si: ඊළග
ta: அடுத்து

source: Get Started
si: ආරම්භ කරන්න
ta: தொடங்கவும்

# settingsTitle
source: Settings
si: සිටුවම්
ta: அமைப்புகள்

# settingsSubtitle
source: Customize your app preferences
si: ඔබගේ යෙදුමේ අභිප්‍රේත සැකසීම
ta: உங்கள் செயலி விருப்பங்களை மாற்றவும்

# settingsSectionLocation
source: Location
si: ස්ථානය
ta: இடம்

# settingsSectionGeneral
source: General
si: සාමාන්‍ය
ta: பொது

# settingsSectionPrayerModes
source: Prayer Notification Modes
si: නමස් දැනුම්දීම් ආකාර
ta: தொழுகை அறிவிப்பு முறைகள்

# settingsSectionAdvanced
source: Advanced
si: උසස්
ta: மேம்பட்டது

# settingsSectionAbout
source: About
si: පිළිබඳ
ta: பற்றி

# settingsPrayerRegion
source: Prayer Times Region
si: ආගමික වේලාවන් කලාපය
ta: தொழுகை நேர பிராந்தியம்

# settingsTheme
source: Theme
si: තේමාව
ta: தீம்

# settingsLanguage
source: Language
si: භාෂාව
ta: மொழி

# settingsNotifications
source: Notifications
si: දැනුම්දීම්
ta: அறிவிப்புகள்

# settingsAlarms
source: Alarms (Azaan)
si: ඇලාම් (අදාන්)
ta: அலாரங்கள் (அதான்)

# settingsAlarmsSubtitle
source: Enable full-screen azaan alarms for prayers
si: නමස් සඳහා සම්පූර්ණ තිර ආගමික ඇඟවීම සක්‍රීය කරන්න
ta: நமாஸிற்கான முழு திரை அதான் அலாரங்களை இயக்கவும்

# settingsShowAdvanced
source: Show Advanced Settings
si: උසස් සිටුවම් පෙන්වන්න
ta: மேம்பட்ட அமைப்புகளை காட்டு

# settingsReset
source: Reset App
si: යෙදුම යළි සැකසීම
ta: செயலி மீட்டமை

# settingsResetConfirm
source: This will clear all settings and restart the onboarding. Are you sure?
si: සියලු සිටුවම් මකා ආන්ඩබෝඩින්ග් නැවත අරඹයි. විශ්වාසද?
ta: அனைத்து அமைப்புகளையும் அழித்து ஆன்போர்டிங்கை மறுதொடக்கம் செய்யும். உறுதியா?

# settingsResetAction
source: Reset
si: යළි සැකසීම
ta: மீட்டமை

# settingsCancel
source: Cancel
si: අවලංගු
ta: ரத்து

# settingsAboutBody
source: This app provides daily salah times for Muslims across Sri Lanka in a simple and easy-to-use format. Prayer times are based on data published by All Ceylon Jamiyyathul Ulama. This app operates independently and has no official connection with ACJU.
si: මෙම යෙදුම ශ්‍රී ලංකාවේ සිටින මුස්ලිම්වරුන්ට නමස් වේලාවන් පහසුවෙන් ලබා දෙයි. වේලාවන් ACJU ප්‍රකාශිත දත්ත මත පදනම් වේ. මෙම යෙදුමට ACJU සමඟ කිසිදු නිල සබඳතාවක් නොමැත.
ta: இச்செயலி இலங்கையில் தொழுகை நேரங்களை எளிதாக வழங்குகிறது. நேரங்கள் ACJU வெளியிட்ட தரவின் அடிப்படையில். இந்த செயலி ACJU-உடன் அதிகாரப்பூர்வ தொடர்பு இல்லை.

source: Test Notification
si: පරීක්ෂණ දැනුම්දීම
ta: சோதனை அறிவிப்பு

source: Test Alarm
si: පරීක්ෂණ ඇලාම්
ta: சோதனை அலாரம்

# pleaseEnableNotifications
source: Please enable notifications first
si: පළමුව දැනුම්දීම් සක්‍රීය කරන්න
ta: முதலில் அறிவிப்புகளை இயக்கவும்

# pleaseEnableAlarms
source: Please enable alarms first
si: පළමුව ඇලාම් සක්‍රීය කරන්න
ta: முதலில் அலாரங்களை இயக்கவும்

# testNotificationBody
source: This is a test notification from Prayer Times
si: මෙය ප්‍රාර්ථනා වේලාවන් යෙදුමෙන් පරීක්ෂණ දැනුම්දීමකි
ta: இது தொழுகை நேரங்களிலிருந்து ஒரு சோதனை அறிவிப்பு

# testAlarmBody
source: This is a test alarm from Prayer Times
si: මෙය ප්‍රාර්ථනා වේලාවන් යෙදුමෙන් පරීක්ෂණ ඇලාම්කි
ta: இது தொழுகை நேரங்களிலிருந்து ஒரு சோதனை அலாரம்

# testAlarmDescription
source: Schedule a test alarm to verify it fires on your device. Uses a short azaan clip for testing.
si: ඔබේ උපාංගයේ ඇලාරම් වැඩද යන්න පරීක්ෂා කිරීමට පරීක්ෂණ ඇලාම් සැකසෙයි. කෙටි අදාන් හඬ භාවිතා කරයි.
ta: உங்கள் சாதனத்தில் செயல்படுகிறதா என சோதனை அலாரம் ஏற்பாடு செய்யவும். குறுகிய அதான் ஒலியைப் பயன்படுத்துகிறது.

# testAlarmSecondsLabel
source: Enter seconds
si: තත්පර සටහන
ta: வினாடிகள் உள்ளிடவும்

# testAlarmSecondsHint
source: e.g. 30
si: උදා. 30
ta: உதா. 30

# testAlarmHelper
source: Uses short azaan. Min 1s, max 6h.
si: කෙටි අදාන්. අවම 1s, උපරිම 6h.
ta: குறுகிய அதான். குறைந்தபட்சம் 1 வி., அதிகபட்சம் 6 மணி.

# testAlarmInvalid
source: Enter a valid number of seconds
si: වලංගු තත්පර ගණනක් ඇතුළත් කරන්න
ta: சரியான வினாடிகளை உள்ளிடவும்

# testAlarmScheduleButton
source: Schedule Test Alarm
si: පරීක්ෂණ ඇලාම් සැකසීම
ta: சோதனை அலாரத்தை திட்டமிடவும்

# testAlarmScheduled30s
source: Test alarm scheduled in 30 seconds
si: පරීක්ෂණ ඇලාම් තත්පර 30කින්
ta: சோதனை அலாரம் 30 வினாடியில்

# testAlarmScheduled1m
source: Test alarm scheduled in 1 minute
si: පරීක්ෂණ ඇලාම් විනාඩි 1න්
ta: சோதனை அலாரம் 1 நிமிடத்தில்

# testAlarmScheduled2m
source: Test alarm scheduled in 2 minutes
si: පරීක්ෂණ ඇලාම් විනාඩි 2කින්
ta: சோதனை அலாரம் 2 நிமிடத்தில்

# testAlarmScheduled5m
source: Test alarm scheduled in 5 minutes
si: පරීක්ෂණ ඇලාම් විනාඩි 5කින්
ta: சோதனை அலாரம் 5 நிமிடத்தில்

# testAlarmScheduledCustom
source: Test alarm scheduled
si: පරීක්ෂණ ඇලාම් සැකස් කළා
ta: சோதனை அலாரம் திட்டமிடப்பட்டது

# testNotificationDescription
source: Test notification-only mode (no alarm or full-screen intent).
si: පරීක්ෂණ දැනුම්දීම (ඇලාම්/සම්පූර්ණ තිර නැත).
ta: சோதனை அறிவிப்பு மட்டும் (அலாரம்/முழுத்திரை இல்லை).

# testNotificationInstant
source: Instantly
si: ඉක්මනින්
ta: உடனே

# testNotification30s
source: In 30 sec
si: තත්පර 30කින්
ta: 30 வினாடியில்

# snackTestNotificationSent
source: Test notification sent
si: පරීක්ෂණ දැනුම්දීම යවන්නා
ta: சோதனை அறிவிப்பு அனுப்பப்பட்டது

# snackTestNotificationScheduled
source: Test notification scheduled in 30 seconds
si: පරීක්ෂණ දැනුම්දීම තත්පර 30කට සැකසිනි
ta: சோதனை அறிவிப்பு 30 வினாடியில் திட்டமிடப்பட்டது

# qiblaTitle
source: Qibla Direction
si: කිබ්ලා දිශාව
ta: கிப்லா திசை

# qiblaSubtitle
source: Point your device towards the Qibla
si: ඔබගේ උපකරණය කිබ්ලා දිශාවට යොමු කරන්න
ta: உங்கள் சாதனத்தை கிப்லா திசைக்கு திருப்பவும்

# qiblaUnsupported
source: Your device does not support compass functionality. Qibla direction is unavailable.
si: ඔබගේ උපාංගය තොරතුරු දක්නාව (කම්පස්) සහය නොදක්වයි. කිබ්ලා දිශාව ලබාගත නොහැක.
ta: உங்கள் சாதனம் திசைகாட்டி வசதியை ஆதரிக்காது. கிப்லா திசை கிடைக்கவில்லை.

# qiblaLocationLabel
source: Location
si: පිහිටුම
ta: இடம்

# qiblaBearingLabel
source: Qibla Bearing
si: කිබ්ලා දිශාව
ta: கிப்லா திசை

# qiblaCalibrateNeeded
source: Your compass needs calibration. Move your device in a gentle figure-8 motion.
si: ඔබගේ කම්පස්ය සකස් කිරීමට අවශ්‍යයි. උපාංගය මෘදු අට අකාරයෙන් ගෙනයන්න.
ta: உங்கள் திசைகாட்டி சீரமைப்பு தேவை. உங்கள் சாதனத்தை மென்மையான எட்டு வடிவத்தில் அசைக்கவும்.

# qiblaCalibrateGeneral
source: Compass accuracy may be affected by nearby electronic devices or metal objects. Calibrate by moving your phone in a figure-8 pattern.
si: අසල ඇති විද්‍යුත් උපාංග හෝ ලෝහ වස්තූන් නිසා කම්පස් නිරවද්‍යතාවට බලපායි. ඔබේ දුරකථනය අට අකාරයෙන් ගෙන යාමෙන් සකස් කරන්න.
ta: அருகிலுள்ள மின்சாதனங்கள் அல்லது இரும்பு பொருட்கள் திசைகாட்டி துல்லியத்தை பாதிக்கலாம். உங்கள் போனையை எட்டு வடிவத்தில் அசைத்து சீரமைக்கவும்.

# prayerTimesTitle
source: Prayer Times
si: නමස් වේලාවන්
ta: தொழுகை நேரங்கள்

# languagePickerLabel
source: Language
si: භාෂාව
ta: மொழி

# regionLabel
source: Region
si: කලාපය
ta: பிராந்தியம்

# alertModeLabel
source: Alert Mode
si: අතුරුදහන් ආකාරය
ta: அறிவிப்பு முறை

# themeLabel
source: Theme
si: තේමාව
ta: தீம்

# prayerFajr
source: Fajr
si: ෆජ්ර්
ta: ஃபஜ்ர்

# prayerSunrise
source: Sunrise
si: සූර්යෝදය
ta: சூரியோதயம்

# prayerDhuhr
source: Dhuhr
si: දුහ්ර්
ta: துஹ்ர்

# prayerAsr
source: Asr
si: අස්ර්
ta: அஸர்

# prayerMaghrib
source: Maghrib
si: මග්‍රිබ්
ta: மஃக்ரிப்

# prayerIsha
source: Isha
si: ඉෂා
ta: இஷா

source: Loading
si: පූරණය වෙමින්
ta: ஏற்றப்படுகிறது

# nextPrayerLabel
source: Next Prayer
si: ඊළඟ නමස්
ta: அடுத்த தொழுகை

# nextEventLabel
source: Next Event
si: ඊළඟ සිදුවීම
ta: அடுத்த நிகழ்வு

source: Time remaining
si: ඉතිරි වූ කාලය
ta: மீதமுள்ள நேரம்

# timeUnitHour
source: H
si: ප
ta: ம

# timeUnitMinute
source: M
si: වි
ta: நி

# timeUnitSecond
source: S
si: ත
ta: வி

# modeAzaan
source: Azaan
si: අදාන්
ta: அதான்

# modeDefault
source: Default
si: පෙරනිමි
ta: இயல்பு

# modeSilent
source: Silent
si: නිහඬ
ta: அமைதி

# calendarTitle
source: Prayer Calendar
si: නමස් දිනදර්ශනය
ta: தொழுகை நாட்காட்டி

# calendarTabMonthly
source: Monthly
si: මාසික
ta: மாதம்

# calendarTabYearly
source: Yearly
si: වාර්ෂික
ta: ஆண்டு

# calendarNoData
source: No calendar data available
si: දිනදර්ශන දත්ත නැත
ta: நாட்காட்டி தரவு இல்லை

# calendarLoading
source: Loading calendar...
si: දිනදර්ශනය පූරණය වේ...
ta: நாட்காட்டி ஏற்றுகிறது...

# testNotificationTitle
source: Test Notification
si: පරීක්ෂණ දැනුම්දීම
ta: சோதனை அறிவிப்பு

# testAlarmTitle
source: Test Alarm
si: පරීක්ෂණ ඇලාම්
ta: சோதனை அலாரம்

source: Test notification sent
si: පරීක්ෂණ දැනුම්දීම යැවියි
ta: சோதனை அறிவிப்பு அனுப்பப்பட்டது

source: Test alarm scheduled
si: පරීක්ෂණ ඇලාම් ක්‍රමාංකනය කළා
ta: சோதனை அலாரம் திட்டமிடப்பட்டது

# actionClose
source: Close
si: වසන්න
ta: மூடு

# actionOk
source: OK
si: හරි
ta: சரி

# actionYes
source: Yes
si: ඔව්
ta: ஆம்

# actionNo
source: No
si: නැහැ
ta: இல்லை

# actionRetry
source: Retry
si: පිළිසකරන්න
ta: மீண்டும் முயற்சி

source: Today
si: අද
ta: இன்று

source: Tomorrow
si: හෙට
ta: நாளை

source: Yesterday
si: ඊයේ
ta: நேற்று

# dayMonday
source: Monday
si: සඳුදා
ta: திங்கட்கிழமை

# dayTuesday
source: Tuesday
si: අඟහරුවාදා
ta: செவ்வாய்க்கிழமை

# dayWednesday
source: Wednesday
si: බදාදා
ta: புதன்கிழமை

# dayThursday
source: Thursday
si: බ්‍රහස්පතින්දා
ta: வியாழக்கிழமை

# dayFriday
source: Friday
si: සිකුරාදා
ta: வெள்ளிக்கிழமை

# daySaturday
source: Saturday
si: සෙනසුරාදා
ta: சனிக்கிழமை

# daySunday
source: Sunday
si: ඉරිදා
ta: ஞாயிற்றுக்கிழமை

# weekdayShortSun
source: S
si: ඉ
ta: ஞா

# weekdayShortMon
source: M
si: ස
ta: தி

# weekdayShortTue
source: T
si: අ
ta: செ

# weekdayShortWed
source: W
si: බ
ta: பு

# weekdayShortThu
source: T
si: බ්‍ර
ta: வி

# weekdayShortFri
source: F
si: සි
ta: வே

# weekdayShortSat
source: S
si: සෙ
ta: ச
